#### Terraform Plan 📖 `failure`

<details><summary>Show Plan</summary>

```

module.email_function.data.external.main: Reading...
data.cloudflare_zones.main: Reading...
module.email_function.data.external.main: Read complete after 0s [id=-]
module.email_function.data.archive_file.main: Reading...
data.cloudflare_zones.main: Read complete after 0s [id=b0c2ab7d66b3c0b219fc876cf1d63fb9]
module.email_function.data.archive_file.main: Read complete after 0s [id=1d6a648fe294ee9c34d8cec9381b39a220b22a92]
module.email_function.data.aws_kms_alias.ssm: Reading...
aws_api_gateway_rest_api.main: Refreshing state... [id=xguhlotnsl]
aws_cloudwatch_event_bus.api_gateway: Refreshing state... [id=api-gateway]
data.aws_cloudfront_origin_request_policy.managed_cors_s3_origin: Reading...
aws_cloudwatch_metric_alarm.lambda_errors: Refreshing state... [id=lambda-errors]
aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:eu-central-1:220746603587:certificate/f4ebd0f0-1e53-49d7-bb39-a5ed253b7959]
data.aws_caller_identity.current: Reading...
module.email_function.data.aws_ssm_parameter.custom[0]: Reading...
aws_cloudwatch_metric_alarm.lambda_throttles: Refreshing state... [id=lambda-throttles]
data.aws_cloudfront_origin_request_policy.managed_cors_s3_origin: Read complete after 1s [id=88a5eaf4-2fd4-4709-b370-b4c650ea3fcf]
aws_cloudfront_origin_access_control.care_bear_shooter_build_bucket: Refreshing state... [id=E9UD6HRKKYL4H]
data.aws_caller_identity.current: Read complete after 1s [id=220746603587]
aws_dynamodb_table.api_gateway_processed_requests: Refreshing state... [id=ApiGatewayProcessedRequests]
data.aws_iam_openid_connect_provider.github: Reading...
data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::220746603587:oidc-provider/token.actions.githubusercontent.com]
module.email_function.aws_sqs_queue.main_deadletter: Refreshing state... [id=https://sqs.eu-central-1.amazonaws.com/220746603587/terraform-20240211081314103700000003]
aws_s3_account_public_access_block.main: Refreshing state... [id=220746603587]
module.email_function.data.aws_ssm_parameter.custom[0]: Read complete after 1s [id=/email-function/mailgun-api-key]
data.aws_cloudfront_cache_policy.managed_caching_optimized: Reading...
module.email_function.data.aws_kms_alias.ssm: Read complete after 1s [id=arn:aws:kms:eu-central-1:220746603587:alias/aws/ssm]
aws_s3_bucket.mtls_truststore: Refreshing state... [id=mtls-truststore-220746603587]
data.aws_cloudfront_cache_policy.managed_caching_optimized: Read complete after 0s [id=b2884449-e4de-46a7-ac36-70bc7f1ddd6d]
aws_s3_bucket.care_bear_shooter_build: Refreshing state... [id=care-bear-shooter-build-220746603587]
aws_s3_bucket.aws_config: Refreshing state... [id=config-bucket-220746603587]
aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway]
module.email_function.terraform_data.commit_sha: Refreshing state... [id=00e39dfd-cd10-c19b-eac9-81b0ed27dcd1]
aws_api_gateway_resource.email_function: Refreshing state... [id=7af8s0]
aws_cloudwatch_metric_alarm.api_gateway_5xx_error: Refreshing state... [id=api-gateway-5xx-error]
aws_cloudwatch_log_group.api_gateway_stage_default: Refreshing state... [id=API-Gateway-Execution-Logs_xguhlotnsl/default]
aws_cloudwatch_metric_alarm.api_gateway_count: Refreshing state... [id=api-gateway-count]
aws_api_gateway_request_validator.validate_request_body: Refreshing state... [id=aijdpj]
aws_schemas_discoverer.test: Refreshing state... [id=events-event-bus-api-gateway]
aws_iam_role.api_gateway_eventbridge: Refreshing state... [id=terraform-20240206162421745900000001]
cloudflare_record.main_validation["sinister-api-test.simonknittel.de"]: Refreshing state... [id=89ca1b9952c1bd25cb32367f72d2bced]
module.email_function_api_gateway.aws_api_gateway_model.request_body: Refreshing state... [id=atb4x1]
aws_api_gateway_account.main: Refreshing state... [id=api-gateway-account]
module.email_function.aws_sqs_queue.main: Refreshing state... [id=https://sqs.eu-central-1.amazonaws.com/220746603587/terraform-20240211081339784400000005]
module.email_function.aws_cloudwatch_metric_alarm.deadletter_messages_received: Refreshing state... [id=deadletter-messages-received-email-function]
module.email_function.aws_cloudwatch_event_rule.main: Refreshing state... [id=arn:aws:events:eu-central-1:220746603587:event-bus/api-gateway/terraform-20240211081314103200000002]
module.email_function_api_gateway.aws_api_gateway_method.main: Refreshing state... [id=agm-xguhlotnsl-7af8s0-POST]
aws_acm_certificate_validation.main: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.email_function_api_gateway.aws_api_gateway_method_response.response_500: Refreshing state... [id=agmr-xguhlotnsl-7af8s0-POST-500]
module.email_function_api_gateway.aws_api_gateway_method_response.response_404: Refreshing state... [id=agmr-xguhlotnsl-7af8s0-POST-404]
module.email_function_api_gateway.aws_api_gateway_method_response.response_400: Refreshing state... [id=agmr-xguhlotnsl-7af8s0-POST-400]
module.email_function_api_gateway.aws_api_gateway_method_response.response_503: Refreshing state... [id=agmr-xguhlotnsl-7af8s0-POST-503]
module.email_function_api_gateway.aws_api_gateway_integration.main: Refreshing state... [id=agi-xguhlotnsl-7af8s0-POST]
module.email_function_api_gateway.aws_api_gateway_method_response.response_200: Refreshing state... [id=agmr-xguhlotnsl-7af8s0-POST-200]
module.email_function.aws_sqs_queue_policy.main: Refreshing state... [id=https://sqs.eu-central-1.amazonaws.com/220746603587/terraform-20240211081339784400000005]
module.email_function.aws_iam_role.main: Refreshing state... [id=terraform-20240211081405377800000007]
module.email_function.aws_sqs_queue_redrive_allow_policy.main_deadletter: Refreshing state... [id=https://sqs.eu-central-1.amazonaws.com/220746603587/terraform-20240211081314103700000003]
module.email_function.aws_cloudwatch_event_target.main: Refreshing state... [id=arn:aws:events:eu-central-1:220746603587:event-bus/api-gateway-terraform-20240211081314103200000002-terraform-20240211081405376200000006]
module.email_function_api_gateway.aws_api_gateway_integration_response.response_500: Refreshing state... [id=agir-xguhlotnsl-7af8s0-POST-500]
module.email_function_api_gateway.aws_api_gateway_integration_response.response_404: Refreshing state... [id=agir-xguhlotnsl-7af8s0-POST-404]
module.email_function_api_gateway.aws_api_gateway_integration_response.response_400: Refreshing state... [id=agir-xguhlotnsl-7af8s0-POST-400]
module.email_function_api_gateway.aws_api_gateway_integration_response.response_503: Refreshing state... [id=agir-xguhlotnsl-7af8s0-POST-503]
module.email_function_api_gateway.aws_api_gateway_integration_response.response_200: Refreshing state... [id=agir-xguhlotnsl-7af8s0-POST-200]
module.email_function.aws_lambda_function.main: Refreshing state... [id=email-function]
aws_api_gateway_deployment.main: Refreshing state... [id=256c4b]
aws_api_gateway_stage.default: Refreshing state... [id=ags-xguhlotnsl-default]
aws_api_gateway_method_settings.all: Refreshing state... [id=xguhlotnsl-default-*/*]
aws_s3_object.mtls_truststore: Refreshing state... [id=truststore.pem]
aws_api_gateway_domain_name.main: Refreshing state... [id=sinister-api-test.simonknittel.de]
module.email_function.aws_lambda_permission.api_gateway: Refreshing state... [id=terraform-20240211081423816900000008]
module.email_function.aws_lambda_event_source_mapping.main: Refreshing state... [id=4c996691-1418-4285-8ef0-8f3745120e5a]
aws_iam_role.care_bear_shooter_build_uploader: Refreshing state... [id=care-bear-shooter-build-uploader]
aws_s3_bucket_cors_configuration.care_bear_shooter_build: Refreshing state... [id=care-bear-shooter-build-220746603587]
aws_cloudfront_distribution.care_bear_shooter_build: Refreshing state... [id=E3GY8A42OQ8RFW]
aws_iam_role.aws_config: Refreshing state... [id=aws-config]
aws_s3_bucket_lifecycle_configuration.aws_config: Refreshing state... [id=config-bucket-220746603587]
aws_api_gateway_base_path_mapping.main: Refreshing state... [id=sinister-api-test.simonknittel.de/]
cloudflare_record.main_cname: Refreshing state... [id=c4fe812314a613cbee9e669930fa4f39]
aws_s3_bucket_policy.care_bear_shooter_build_cloudfront: Refreshing state... [id=care-bear-shooter-build-220746603587]
aws_config_configuration_recorder.default: Refreshing state... [id=default]
aws_config_delivery_channel.default: Refreshing state... [id=default]
aws_config_configuration_recorder_status.default: Refreshing state... [id=default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.email_function.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "email-function"
      ~ last_modified                  = "2024-02-14T21:14:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "KO8j66Zk6JBCDkuogtInqTMA5erh7FZigjAOvtEOLBI=" -> "W/sPoygAA2ON7cHvXOlphgL67pQw50pSyFmi8dTJ/0c="
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COMMIT_SHA" = "85642f0566cc45468a7d5f293a2723de237f0dc9"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.email_function.terraform_data.commit_sha must be replaced
-/+ resource "terraform_data" "commit_sha" {
      ~ id               = "00e39dfd-cd10-c19b-eac9-81b0ed27dcd1" -> (known after apply)
      ~ input            = "85642f0566cc45468a7d5f293a2723de237f0dc9" -> "0e4e833cadfbd7779fdd15d154c07d7c07ab9f40"
      ~ output           = "85642f0566cc45468a7d5f293a2723de237f0dc9" -> (known after apply)
      ~ triggers_replace = "KO8j66Zk6JBCDkuogtInqTMA5erh7FZigjAOvtEOLBI=" -> "W/sPoygAA2ON7cHvXOlphgL67pQw50pSyFmi8dTJ/0c="
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

</details>